tutorials/simulations/doubleHole/P15kW_lambda120/01.BFER2.unsteady/0.orig/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   		uniform 2000;
Twater				uniform 333.15 ;
exchangeCoefficient		uniform 5000. ;	

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 298.15;
    }
    outlet
    {
        type            zeroGradient;
    }


    sideWest
    {
        type            symmetryPlane;
    }
    sideEast
    {
        type            symmetryPlane;
    }
    faceNorth
    {
        type            symmetryPlane;
    }
    faceSouth
    {
        type            symmetryPlane;
    }

    heatExchanger
    {
        type            externalWallHeatFluxTemperatureOpenSMOKEpp;
        mode            coefficient;
        Ta              $Twater;
        h               $exchangeCoefficient;
        thicknessLayers ( 0.002 );
        kappaLayers     ( 45 );
        value           uniform 298.15;
    }

    fluid_to_solid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixedOpenSMOKEpp;
        Tnbr            T;
        value           uniform 298.15;
    }
}


// ************************************************************************* //
