tutorials/simulations/doubleHole/P15kW_lambda120/01.BFER2.unsteady/0.orig/fluid/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    sideWest
    {
        type            symmetryPlane;
    }
    sideEast
    {
        type            symmetryPlane;
    }

    faceNorth
    {
        type            symmetryPlane;
    }
    faceSouth
    {
        type            symmetryPlane;
    }

    heatExchanger
    {
        type            zeroGradient;
    }

    fluid_to_solid
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
