tutorials/simulations/doubleHole/P15kW_lambda120/01.BFER2.unsteady/0.orig/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.0011/fluid";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325.; 

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 101235;
        value           uniform 101235;
    }


    sideWest
    {
        type            symmetryPlane;
    }
    sideEast
    {
        type            symmetryPlane;
    }
    faceNorth
    {
        type            symmetryPlane;
    }
    faceSouth
    {
        type            symmetryPlane;
    }
    sideWall
    {

    }

    heatExchanger
    {
        type            zeroGradient;
    }

    fluid_to_solid
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
