tutorials/simulations/doubleHole/P15kW_lambda120/01.BFER2.unsteady/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    outlet
    {
        type            patch;
        nFaces          58;
        startFace       169653;
    }
    sideEast
    {
        type            symmetryPlane;
        nFaces          3523;
        startFace       169711;
    }
    sideWest
    {
        type            symmetryPlane;
        nFaces          3480;
        startFace       173234;
    }
    faceNorth
    {
        type            symmetryPlane;
        nFaces          1055;
        startFace       176714;
    }
    faceSouth
    {
        type            symmetryPlane;
        nFaces          1035;
        startFace       177769;
    }
    heatExchanger
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          571;
        startFace       178804;
    }
    inlet
    {
        type            patch;
        nFaces          410;
        startFace       179375;
    }
    fluid_to_solid
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          1172;
        startFace       179785;
        sampleMode      nearestPatchFace;
        sampleRegion    solid;
        samplePatch     solid_to_fluid;
    }
)

// ************************************************************************* //
