tutorials/simulations/doubleHole/P15kW_lambda120/01.BFER2.unsteady/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         			none;

    div(phi,U)      			Gauss upwind;
    div(phi,Yi_hs)   			Gauss upwind;
    div(phic,Yi)    			Gauss upwind;
    div(phi,T)      			Gauss upwind;
    div(phid,p)     			Gauss upwind;
    div(mix:hs_Js)  			Gauss upwind;
    
    div(phi,csi)      			Gauss upwind;
    div(phi,tau)      			Gauss upwind;

    div(Ji,Ii_h)    			bounded Gauss linearUpwind grad(Ii_h);
    div((mix:mu*dev2(grad(U).T())))	Gauss linear;
}

laplacianSchemes
{
//  default         Gauss linear orthogonal;
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p	              ;
}


// ************************************************************************* //
