tutorials/simulations/doubleHole/P15kW_lambda120/01.BFER2.unsteady/system/fluid/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
);

// Initialize
regions
(
    // Last flames
    // Burner radii: 34.3-34.9 mm
    boxToCell
    {
        box (-1 34.6 64e-4) (1 35.9e-3 92e-3);
        fieldValues
        (
            	volScalarFieldValue T   2200.
        );
    }

    // Inside 
    boxToCell
    {
        box (-1 -1 -1) (1 40.6e-3 92.0e-3 );
        fieldValues
        (
            	volScalarFieldValue CH4  	0.046296296
            	volScalarFieldValue O2   	0.222222222
            	volScalarFieldValue N2   	0.731481482

		volScalarFieldValue CO2   	0.
		volScalarFieldValue H2O   	0.
        );
    }
         
    // Inside
    boxToCell
    {
        box (-1 -1 -1) (1 34.6e-3 92e-3);
        fieldValues
        (
            	volScalarFieldValue T   298.15
        );
    }

    // HeatExchanger region
    boxToCell
    {
        box (-1 90e-3 -1) (1 1 1);
        fieldValues
        (
            	volScalarFieldValue T   333.15
        );
    }
 
);

/*
// Reignite last flames
regions
(
    // Burner radii: 34.3-34.9 mm

    // Last flames
    boxToCell
    {
        box (-1 34.3e-3 64e-3) (1 50.9e-3 92e-3);	// 16 mm above the surface
        fieldValues
        (
            	volScalarFieldValue T   2400.
        );
    }

    // First flames
    boxToCell
    {
        box (-1 34.3e-3 16e-3) (1 50.9e-3 30e-3);	// 16 mm above the surface
        fieldValues
        (
            	volScalarFieldValue T   2400.
        );
    }

    // Inside
    boxToCell
    {
        box (-1 -1 -1) (1 34.3e-3 92e-3);
        fieldValues
        (
		volScalarFieldValue CH4  	0.046296296
            	volScalarFieldValue O2   	0.222222222
            	volScalarFieldValue N2   	0.731481482
		volScalarFieldValue CO2   	0.
		volScalarFieldValue H2O   	0.

            	volScalarFieldValue T   	298.15
        );
    }
);
*/

// ************************************************************************* //
